Revit 2015 API
BoundarySegmentArrayArray.Size Property
Returns the number of boundary segment arrays that are in the array.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual int Size { get; }
Visual Basic
Public Overridable ReadOnly Property Size As Integer
	Get
Visual C++
public:
virtual property int Size {
	int get ();
}
See Also
BoundarySegmentArrayArray Class
Autodesk.Revit.DB.Mechanical Namespace